import type { Translation } from "./translationsType"

export const translation: Translation = {
  header: {
    examplesLink: 'Примеры',
    contactsLink: 'Связаться'
  },
  home: {
    title: 'Примеры генерации контента',
    paragraph: 'На этой странице представлены примеры автоматически сгенерированных кластеров контента. Статьи размещены исключительно в демонстрационных целях и не предназначены для индексации поисковыми системами.',
    genTime: 'Время генерации всего кластера',
    genCost: 'Стоимость генерации всего кластера менее',
    filter: {
      label: 'Показать',
      all: 'Все',
      pillars: 'Опорные',
      clusters: 'Кластеры',
    }
  },
  blog: {
    backTo: 'Назад ко всем блогам',
    h1Title: 'Эта страница показывает только пример генерации',
  }
}